Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/drupal-tm.tmx
Source language: en
Languages: ca_es

source: Stores fields in the local SQL database, using per-field tables.
ca_es: Emmagatzema els camps en una base de dades SQL local, utilitzant taules per cada camp.

source: Stores field data in an SQL database.
ca_es: Emmagatzema les dades dels camps en una base de dades SQL.

source: The List module defines various fields for storing a list of items, for use with the Field module. Usually these items are entered through a select list, checkboxes, or radio buttons. See the <a href="@field-help">Field module help page</a> for more information about fields.
ca_es: El mòdul List defineix diversos camps per emmagatzemar una llista d'elements, per a utilitzar amb el mòdul Field. Aquests elements s'introdueixen normalment a través d'una llista de selecció, caselles de verificació o botons d'opció. Aneu a la <a href="@field-help">pàgina d'ajuda del mòdul Field</a> per a més informació sobre camps.

source: This field stores numeric keys from key/value lists of allowed values where the key is a simple alias for the position of the value, i.e. 0|First option, 1|Second option, 2|Third option.
ca_es: Aquest camp emmagatzema claus numèriques de llistes clau/valor de valors permesos on la clau és un simple àlies de la posició del valor, p.e. 0|Primera opció, 1|Segona opció, 2|Tercera opció.

source: This field stores simple on/off or yes/no options.
ca_es: Aquest camp emmagatzema opcions simples com actiu/inactiu o sí/no.

source: List (numeric)
ca_es: Llista (numèrica)

source: This field stores keys from key/value lists of allowed numbers where the stored numeric key has significance and must be preserved, i.e. 'Lifetime in days': 1|1 day, 7|1 week, 31|1 month.
ca_es: Aquest camp emmagatzema claus de llistes clau/valor de números permesos on la clau numèrica emmagatzemada té un significat i ha de mantenir-se, p.e. 'Temps de vida en dies': 1|1 dia, 7|1 setmana, 31|1 mes.

source: List (text)
ca_es: Llista (text)

source: This field stores keys from key/value lists of allowed values where the stored key has significance and must be a varchar, i.e. 'US States': IL|Illinois, IA|Iowa, IN|Indiana
ca_es: Aquest camp emmagatzema claus de llistes clau/valor de valors permesos on la clau emmagatzemada té un significat i ha de ser una cadena de mida variable, p.e. 'Estats dels EEUU': IL|Illinois, IA|Iowa, IN|Indiana.

source: The possible values this field can contain. Enter one value per line, in the format key|label. The key is the value that will be stored in the database, and must be a %type value. The label is optional, and the key will be used as the label if no label is specified.
ca_es: Els valors possibles que pot contenir aquest camp. Introduïu un valor per línia, en el format clau|valor. La clau és el valor que s'emmagatzemarà a la base de dades, i ha de ser un valor de tipus %type. L'etiqueta és opcional, i s'utilitzarà la clau com a etiqueta si aquesta no s'especifica.

source: The 'checkboxes/radio buttons' widget will display checkboxes if the <em>Number of values</em> option is greater than 1 for this field, otherwise radios will be displayed.
ca_es: El giny 'caselles de verificació/botons de selecció' mostrarà caselles de verificació si l'opció <em>Nombre de valors</em> és més gran que 1 per aquest camp, en cas contrari es mostraran botons de selecció.

source: Allowed HTML tags in labels: @tags
ca_es: Etiquetes HTML permeses a les etiquetes: @tags

source: The value of this field is being determined by the %function function and may not be changed.
ca_es: El valor d'aquest camp es determina per la funció %function i no es pot canviar.

source: Allowed values list: each key must be a valid integer or decimal.
ca_es: Llista de valors permesos: cadascuna de les claus ha de ser un enter o un decimal vàlid.

source: Allowed values list: each key must be a string at most 255 characters long.
ca_es: Llista de valors permesos: cadascuna de les claus ha de ser una cadena de com a molt 255 caràcters.

source: Allowed values list: keys must be integers.
ca_es: Llista de valors permesos: les claus han de ser enters.

source: Allowed values list: keys must be either 0 or 1.
ca_es: Llista de valors permesos: les claus han de ser o bé 0 o bé 1.

source: Allowed values list: two values are required.
ca_es: Llista de valors permesos: es requereixen dos valors.

source: Defines list field types. Use with Options to create selection lists.
ca_es: Defineix els tipus de camp llistes. Utilitzeu-lo amb Options per a crear llistes de selecció.

source: The Number module defines various numeric field types for the Field module. Numbers can be in integer, decimal, or floating-point form, and they can be formatted when displayed. Number fields can be limited to a specific set of input values or to a range of values. See the <a href="@field-help">Field module help page</a> for more information about fields.
ca_es: El mòdul Number defineix diversos tipus de camps numèric per al mòdul Field. Els números poden ser en forma d'enters, de decimals o de coma flotant, i poden ser formatats quan es mostrin. Els camps numèrics poden estar limitats a un conjunt de valors d'entrada o a un rang de valors. Aneu a la <a href="@field-help">pàgina d'ajuda del mòdul Field</a> per a més informació sobre camps.

source: This field stores a number in the database as an integer.
ca_es: Aquest camp emmagatzema un número a la base de dades com un enter.

source: This field stores a number in the database in a fixed decimal format.
ca_es: Aquest camp emmagatzema un número a la base de dades en format de decimal fix.

source: This field stores a number in the database in a floating point format.
ca_es: Aquest camp emmagatzema un número a la base de dades en format de coma flotant.

source: The minimum value that should be allowed in this field. Leave blank for no minimum.
ca_es: El valor mínim que s'ha de permetre en aquest camp. Deixeu-ho en blanc per no establir cap mínim.

source: The maximum value that should be allowed in this field. Leave blank for no maximum.
ca_es: El valor màxim que s'ha de permetre en aquest camp. Deixeu-ho en blanc per no establir cap màxim.

source: Define a string that should be prefixed to the value, like '$ ' or '&euro; '. Leave blank for none. Separate singular and plural values with a pipe ('pound|pounds').
ca_es: Definiu una cadena de text que s'utilitzarà com a prefix del valor, com per exemple '$' o '&euro; '. Deixeu-ho en blanc per no establir-ne cap. Separeu els valors singular i plural amb una barra vertical ('lliura|lliures')

source: Define a string that should suffixed to the value, like ' m', ' kb/s'. Leave blank for none. Separate singular and plural values with a pipe ('pound|pounds').
ca_es: Definiu una cadena de text que s'utilitzarà com a sufix del valor, com per exemple 'm' o 'kb/s'. Deixeu-ho en blanc per no establir-ne cap. Separeu els valors singular i plural amb una barra vertical ('lliura|lliures')

source: Only numbers and the decimal separator (@separator) allowed in %field.
ca_es: Només es permeten números i el separador de decimals (@separator) a %field.

source: The Options module defines checkbox, selection, and other input widgets for the Field module. See the <a href="@field-help">Field module help page</a> for more information about fields.
ca_es: El mòdul Options defineix el giny de casella de verificació, selecció, i d'alters ginys d'entrada per al mòdul Field. Aneu a la <a href="@field-help">pàgina d'ajuda del mòdul Field</a> per a més informació sobre camps.

source: The Text module defines various text field types for the Field module. A text field may contain plain text only, or optionally, may use Drupal's <a href='@filter-help'>text filters</a> to securely manage HTML output. Text input fields may be either a single line (text field), multiple lines (text area), or for greater input control, a select box, checkbox, or radio buttons. If desired, the field can be validated, so that it is limited to a set of allowed values. See the <a href='@field-help'>Field module help page</a> for more information about fields.
ca_es: El mòdul Text defineix diversos tipus de camp de text pel mòdul Field. Un camp de text pot contenir només text pla, o de forma opcional, pot utilitzar els <a href="@filter-help">filtres de text</a> del Drupal per gestionar de forma segura la sortida en HTML. Els camps d'entrada de text poden ser de només una línia (camp de text), múltiples línies (àrees de text), o per a major control d'entrada, una caixa de selecció, caselles de selecció o botons d'opció. Si es vol, el camp pot ser validat, pel que es limita a un conjunt de valors permesos. Aneu a la <a href="@field-help">pàgina d'ajuda del mòdul Field</a> per a més informació sobre camps.

source: This field stores varchar text in the database.
ca_es: Aquest camp emmagatzema un text de mida variable a la base de dades.

source: Long text
ca_es: Text llarg

source: This field stores long text in the database.
ca_es: Aquest camp emmagatzema un text llarg a la base de dades.

source: Long text and summary
ca_es: Text llarg i resum

source: This field stores long text in the database along with optional summary text.
ca_es: Aquest camp emmagatzema un text llarg a la base de dades juntament amb el text de resum opcional.

source: Filtered text (user selects text format)
ca_es: Text filtrat (l'usuari selecciona el format de text)

source: Summary input
ca_es: Introducció del resum

source: This allows authors to input an explicit summary, to be displayed instead of the automatically trimmed text when using the "Summary or trimmed" display type.
ca_es: Això permet a l'autor introduir un resum explícit, per a ésser mostrat en comptes del text retallat automàticament al utilitzar el mode de visualització de "Resum o retallat".

source: %name: the text may not be longer than %max characters.
ca_es: %name: el text no pot ser més llarg de %max caràcters.

source: %name: the summary may not be longer than %max characters.
ca_es: %name: el resum no pot ser més llarg de %max caràcters.

source: Summary or trimmed
ca_es: Resum o retallat

source: Text area with a summary
ca_es: Àrea de text amb un resum

source: Leave blank to use trimmed value of full text as the summary.
ca_es: Deixeu-ho en blanc per a utilitzar el valor retallat del text com a resum.

source: Hide summary
ca_es: Amaga el resum

source: Edit summary
ca_es: Edita el resum

source: %field (@field_name) field requires the %widget_type widget provided by %widget_module module
ca_es: El camp %field (@field_name) necessita el giny %widget_type proporcionat pel mòdul %widget_module.

source: Inactive fields are not shown unless their providing modules are enabled. The following fields are not enabled: !list
ca_es: Els camps inactius no es mostren a menys que els mòduls que els proporcionen estiguin habilitats. Els següents camps no estan habilitats: !list

source: Edit field settings.
ca_es: Edita els paràmetres del camp.

source: Change widget type.
ca_es: Canvia el tipus de giny.

source: Edit instance settings.
ca_es: Edita els paràmetres de la instància.

source: Delete instance.
ca_es: Suprimeix la instància.

source: There was a problem creating field %label: @message.
ca_es: Hi ha hagut un error al crear el camp %label: @message.

source: The field %label cannot be added because it is locked.
ca_es: No s'ha pogut afegir el camp %label perquè està bloquejat.

source: There was a problem creating field instance %label: @message.
ca_es: Hi ha hagut un problema al crear la instància del camp %label: @message.

source: There are no fields yet added. You can add new fields on the <a href="@link">Manage fields</a> page.
ca_es: No s'han afegit camps encara. Podeu afegir-ne a la pàgina d'<a href="@link">Administració dels camps</a>.

source: These settings apply to the %field field everywhere it is used. These settings impact the way that data is stored in the database and cannot be changed once data has been created.
ca_es: Aquests paràmetres s'apliquen al camp %field a qualsevol lloc que s'utilitzi. Aquests paràmetres impacten en la manera en que s'emmagatzemen les dades a la base de dades i no es poden canviar un cop les dades s'hagin creat.

source: %field has no field settings.
ca_es: %field no té paràmetres de camp.

source: Updated field %label field settings.
ca_es: S'ha actualitzat els paràmetres del camp %label.

source: Attempt to update field %label failed: %message.
ca_es: Ha fallat l'intent d'actualitzar el camp %label: %message.

source: Change widget
ca_es: Canvia el giny

source: The type of form element you would like to present to the user when creating this field in the %type type.
ca_es: El tipus d'element de formulari que voleu presentar a l'usuari quan s'estigui creant aquest camp en el tipus %type.

source: Changed the widget for field %label.
ca_es: S'ha canviat el giny del camp %label.

source: There was a problem changing the widget for field %label.
ca_es: Hi ha hagut un problema al canviar el giny pel camp %label.

source: This field is <strong>locked</strong> and cannot be deleted.
ca_es: El camp està <strong>bloquejat</strong> i no es pot suprimir.

source: The field %field has been deleted from the %type content type.
ca_es: El camp %field ha estat eliminat del tipus de contingut %type.

source: There was a problem removing the %field from the %type content type.
ca_es: Hi ha hagut un problema al esborrar el camp %field del tipus de contingut %type.

source: These settings apply only to the %field field when used in the %type type.
ca_es: Aquests paràmetres s'apliquen només al camp %field quan s'utilitzi en el tipus %type.

source: Required field
ca_es: Camp obligatori

source: These settings apply to the %field field everywhere it is used. Because the field already has data, some settings can no longer be changed.
ca_es: Aquests paràmetres s'apliquen al camp %field a qualsevol lloc que s'utilitzi. Com el camp ja té dades, alguns paràmetres no es podran canviar.

source: These settings apply to the %field field everywhere it is used.
ca_es: Aquests paràmetres s'apliquen al camp %field a qualsevol lloc que s'utilitzi.

source: %field field settings
ca_es: Paràmetres del camp %field

source: The default value for this field, used when creating new content.
ca_es: El valor predeterminat d'aquest camp, utilitzat quan es crea contingut nou.

source: Saved %label configuration.
ca_es: S'ha desat la configuració de %label.

source: The Field UI module provides an administrative user interface (UI) for adding custom fields to content types, users, comments, and other types of data. The field types are defined by other modules, and collected and managed by the <a href="@field">Field module</a>. For more information, see the online handbook entry for <a href="@field-ui">Field UI module</a>.
ca_es: El mòdul Field UI proporcionar una interfície d'usuari (UI) d'administració per afegir camps personalitzats a tipus de contingut, usuaris, comentaris i d'altres tipus de dades. Els tipus de camps estan definits per altres mòduls, i recollits i gestionats pel <a href="@field">mòdul Field</a>. Per a més informació, aneu a la secció del <a href="@field-ui">mòdul Field UI</a> del manual en línia.

source: Defining custom fields
ca_es: Definició de camps personalitzats

source: When adding a custom field, you need to determine whether the field type will contain text, numbers, lists, etc., as well as how it will be input (as a text field, text area, select box, checkboxes, radio buttons, etc.). A field may have a single value or multiple values. For example, an employee field might have a single employee identification number, whereas a phone number field might have multiple phone numbers.
ca_es: Al afegir un camp personalitzat, heu de determinar si el tipus de camp contindrà text, números, llistes, etc., així com el tipus d'entrada (com a camp de text, àrea de text, caixa de selecció, caselles de verificació, botons d'opció, etc.). Un camp pot tenir un únic valor o múltiples. Per exemple, un camp empleat pot tenir un únic identificador d'empleat, mentre que un camp número de telèfon pot tenir múltiples números de telèfons.

source: Adding fields to content types
ca_es: Afegir camps a tipus de contingut

source: Some fields are provided by default when you create a content type, such as the Title and Body fields. The Field UI module lets administrators edit or delete the default fields attached to content, as well as create new fields for storing any additional information. Field configuration is accessible through tabs on each specific content type's configuration page, listed on the <a href='@content-types'>Content types administration page</a>. See the <a href='@node-help'>Node module help page</a> for more information about content types.
ca_es: Alguns camps es proporcionen per defecte quan creeu un tipus de contingut, com poden ser els camps de Títol i Cos. El mòdul Field UI permet als administradors editar i suprimir els camps predeterminats vinculats a un contingut, així com crear nous camps per emmagatzemar qualsevol informació addicional. Es pot accedir a la configuració del camp a través de pestanyes a la pàgina de configuració de cada tipus de contingut, llistats a la <a href="@content-types">pàgina d'administració de tipus de contingut</a>. Aneu a la <a href="@node-help">pàgina d'ajuda del mòdul Node</a> per a més informació sobre els tipus de contingut.

source: This list shows all fields currently in use for easy reference.
ca_es: Aquest llistat mostra tots els camps que s'utilitzen actualment per a una fàcil referència.

source: Save and add fields
ca_es: Desa i afegeix camps

source: Field list
ca_es: Llista de camps

source: Overview of fields on all object types.
ca_es: Resum dels camps a tots els tipus d'objectes.

source: Edit instance settings
ca_es: Edita els paràmetres de la instància

source: Edit field settings
ca_es: Edita els paràmetres del camp

source: Change widget type
ca_es: Canvia el tipus de giny

source: Delete instance
ca_es: Suprimeix la instància

source: Manage display
ca_es: Gestiona la presentació

source: User Interface for the Field API.
ca_es: Interfície d'usuari per al Field API.

source: This field stores the ID of a file as an integer value.
ca_es: Aquest camp emmagatzema l'ID d'un camp com un valor enter.

source: Enable <em>Display</em> field
ca_es: Habilita el camp <em>Visualització</em>

source: The display option allows users to choose if a file should be shown when viewing the content.
ca_es: L'opció de visualització permet als usuaris escollir si s'ha de mostrar un fitxer quan es visualitza el contingut.

source: Files displayed by default
ca_es: Els fitxers es mostren per defecte

source: This setting only has an effect if the display option is enabled.
ca_es: Aquest paràmetre només té efecte si l'opció de visualització està habilitada.

source: Upload destination
ca_es: Destí de les càrregues

source: Select where the final files should be stored. Private file storage has significantly more overhead than public files, but allows restricted access to files within this field.
ca_es: Seleccioneu on voleu emmagatzemar els fitxers finals. L'emmagatzemament de fitxers privats té una sobrecàrrega significant respecte els fitxers públic, però permet l'accés restringit als fitxers d'aquest camp.

source: Optional subdirectory within the upload destination where files will be stored. Do not include preceding or trailing slashes.
ca_es: Subdirectori opcional, dins del destí de les càrregues, on s'emmagatzemaran els fitxers. No inclogueu les barres de l'inici ni del final.

source: Separate extensions with a space or comma and do not include the leading dot. Leaving this blank will allow users to upload a file with any extension.
ca_es: Separeu les extensions amb un espai o una coma i no inclogueu el punt de l'extensió. Si deixeu en blanc aquest camp, permetreu als usuaris pujar un fitxer amb qualsevol extensió.

source: Enter a value like "512" (bytes), "80 KB" (kilobytes) or "50 MB" (megabytes) in order to restrict the allowed file size. If left empty the file sizes will be limited only by PHP's maximum post and file upload sizes (current limit <strong>%limit</strong>).
ca_es: Introduïu un valor com "512" (bytes), "80 KB" (kilobytes) o "50 MB" (megabytes) per a restringir la mida de fitxer permesa. Si ho deixeu en blanc, la mida del fitxer només es limitarà per la mida màxima de post i la mida de les càrregues de fitxers del PHP (el límit actual és <strong>%limit</strong>).

source: Enable <em>Description</em> field
ca_es: Habilita el camp <em>Descripció</em>

source: The description field allows users to enter a description about the uploaded file.
ca_es: El camp descripció permet als usuaris introduir una descripció sobre el fitxer carregat.

source: The "!name" option must contain a valid value. You may either leave the text field empty or enter a string like "512" (bytes), "80 KB" (kilobytes) or "50 MB" (megabytes).
ca_es: L'opció "!name" ha de contenir un valor vàlid. Podeu o bé deixar el camp de text buit o bé introduir una cadena com "512" (bytes), "80 KB" (kilobytes) o "50 MB" (megabytes).

source: The list of allowed extensions is not valid, be sure to exclude leading dots and to separate extensions with a comma or space.
ca_es: La llista d'extensions permeses no és vàlida. Assegureu-vos d'excloure el punt inicial i de separa les extensions amb una coma o un espai.

source: The file directory (@file_directory) cannot start with the system files directory (@files_directory), as this may cause conflicts when building file URLs.
ca_es: El directori del fitxer (@file_directory) no pot començar amb pel directori de fitxers del sistema (@files_directory), ja que això pot causar conflictes al crear la URL dels fitxers.

source: Generic file
ca_es: Fitxer genèric

source: Table of files
ca_es: Taula de fitxers

source: The throbber display does not show the status of uploads but takes up space. The progress bar is helpful for monitoring progress on large uploads.
ca_es: La presentació del throbber no mostra l'estat de les càrregues però omple espai. La barra de progrés és útil per controlar el progrés de les càrregues grans.

source: Add a new file
ca_es: Afegeix un nou fitxer

source: Include file in display
ca_es: Inclou el fitxer en la visualització

source: The description may be used as the label of the link to the file.
ca_es: La descripció es pot utilitzar com a l'etiqueta de l'enllaç al fitxer.

source: Files must be less than !size.
ca_es: Els fitxers han de ser de menys de !size.

source: Allowed file types: !extensions.
ca_es: Tipus de fitxers permesos: !extensions.

source: Images must be exactly !size pixels.
ca_es: Les imatges han de ser exactament de !size píxels.

source: Images must be between !min and !max pixels.
ca_es: Les imatges han de ser d'entre !min i !max píxels.

source: Images must be larger than !min pixels.
ca_es: Les imatges han de ser de més de !min píxels.

source: Images must be smaller than !max pixels.
ca_es: Les imatges han de ser de menys de !max píxels.

source: The File module defines a <em>File</em> field type for the Field module, which lets you manage and validate uploaded files attached to content on your site (see the <a href="@field-help">Field module help page</a> for more information about fields). For more information, see the online handbook entry for <a href="@file">File module</a>.
ca_es: El mòdul File defineix un tipus de camp <em>Fitxer</em> per al mòdul Field, el qual us permet gestionar i validar la càrrega de fitxers adjunts al contingut al vostre lloc (aneu a la <a href="@field-help">pàgina d'ajuda del mòdul Field</a> per a més informació sobre camps). Per a més informació, aneu a la secció del <a href="@file">mòdul File</a> del manual en línia.
